early-init.org
#+TITLE: config.el
#+AUTHOR: Yoshihide Chubachi

* early-init.el

#+begin_comment
+ early-init.elを生成するには C-c C-v t (org-babel-tangle) を実行
#+end_comment

** あらまし
+ early-init.elはinit.elより前に読み込まれる設定ファイルである
+ ここでパッケージ管理機能の初期設定等を行うと、後で読み込まれるinit.elに反映さ
  れる
+ GUIの初期化前に読み込まれるので、例えばフレームのサイズをここで設定しておくと、
  はじめからその設定で表示される
  + init.elで変更すると一度デフォルトのサイズで表示されてから、設定したサイズに
    切り替わるので画面がちらつく
** ヘッダー
#+begin_src emacs-lisp :tangle "early-init.el"
  ;;; early-init.el --- My early-init.el  -*- lexical-binding: t; -*-
  ;; Copyright (C) 2022-2025 Yoshihide Chubachi

  ;; Author: Yoshihide Chubachi <yoshi@chubachi.net>

  ;; This program is free software: you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.

  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.

  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

  ;;; Commentary:

  ;; このファイルはearly-init.orgから生成します。

  ;;; Code:
#+end_src

** パッケージ関連

+ 標準パッケージとstraight.el、leafを設定

#+begin_src emacs-lisp :tangle "early-init.el"
  (eval-and-compile
    (prog1 "package"
      (customize-set-variable
       'package-archives '(("org" . "https://orgmode.org/elpa/")
                           ("melpa" . "https://melpa.org/packages/")
                           ("gnu" . "https://elpa.gnu.org/packages/")))
      (package-initialize))

    (prog1 "straight.el"
      (defvar bootstrap-version)
      (let ((bootstrap-file
             (expand-file-name
              "straight/repos/straight.el/bootstrap.el"
              (or (bound-and-true-p straight-base-dir)
                  user-emacs-directory)))
            (bootstrap-version 7))
        (unless (file-exists-p bootstrap-file)
          (with-current-buffer
              (url-retrieve-synchronously
               "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
               'silent 'inhibit-cookies)
            (goto-char (point-max))
            (eval-print-last-sexp)))
        (load bootstrap-file nil 'nomessage)))

    (prog1 "leaf"
      (straight-use-package 'leaf)
      (straight-use-package 'leaf-keywords)
      (leaf-keywords-init)))
#+end_src

** no-litteringのための設定
+  https://github.com/emacscollective/no-littering/blob/master/README.org

#+Begin_src emacs-lisp :tangle early-init.el
  (when (fboundp 'startup-redirect-eln-cache)
    (startup-redirect-eln-cache
     (convert-standard-filename
            (expand-file-name  "var/eln-cache/" user-emacs-directory))))
#+end_src
** フッター
#+begin_src emacs-lisp :tangle early-init.el
;;; early-init.el ends here
#+end_src
